meshtastic/ESP32-CH390/src/esp_eth_mac_ch390_arduino.cpp
/*
 * Arduino-compatible port of the CH390 SPI Ethernet MAC driver.
 *
 * Derived from the ESP-IDF CH390 driver:
 *   SPDX-FileCopyrightText: 2024-2025 Espressif Systems (Shanghai) CO LTD
 *   SPDX-FileContributor:   2024-2025 Sergey Kharenko
 *   Originally licensed under the Apache License, Version 2.0.
 *
 * Port and modifications:
 *   SPDX-FileCopyrightText: 2024-2026 Thomas Goettgens and contributors
 *
 * SPDX-License-Identifier: LGPL-3.0-or-later
 *
 * Upstream source:
 *   https://github.com/espressif/esp-eth-drivers/tree/master/ch390
 *
 * The Apache-2.0 license permits redistribution of derivative works under
 * the GNU LGPL v3; the combined work in this file is distributed under
 * LGPL-3.0-or-later. See LICENSE and NOTICE in the project root for details.
 */

#include "esp_eth_mac_ch390_arduino.h"
#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_check.h"
#include "esp_eth_com.h"
#include "esp_eth_mac.h"
#include "esp_heap_caps.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include <stdlib.h>
#include <string.h>

static const char *TAG = "ch390.mac";

#define GOTO_ON_ERROR(expr, label)                                             \
  do {                                                                         \
    esp_err_t err_rc_ = (expr);                                                \
    if (err_rc_ != ESP_OK) {                                                   \
      ret = err_rc_;                                                           \
      goto label;                                                              \
    }                                                                          \
  } while (0)

#define GOTO_ON_FALSE(cond, err_code, label)                                   \
  do {                                                                         \
    if (!(cond)) {                                                             \
      ret = (err_code);                                                        \
      goto label;                                                              \
    }                                                                          \
  } while (0)

// CH390 SPI Commands
#define CH390_SPI_WR 1 // SPI write opcode (1 bit, placed in trans.cmd)
#define CH390_SPI_RD 0 // SPI read opcode

// CH390 Registers
#define CH390_NCR 0x00     // Network Control Register
#define CH390_NSR 0x01     // Network Status Register
#define CH390_TCR 0x02     // TX Control Register
#define CH390_WCR 0x03     // Wakeup Control Register
#define CH390_RCR 0x05     // RX Control Register
#define CH390_RSR 0x06     // RX Status Register
#define CH390_EPCR 0x0B    // EEPROM & PHY Control Register
#define CH390_EPAR 0x0C    // EEPROM & PHY Address Register
#define CH390_EPDRL 0x0D   // EEPROM & PHY Low Data Register
#define CH390_EPDRH 0x0E   // EEPROM & PHY High Data Register
#define CH390_PAR 0x10     // Physical Address Register (6 bytes)
#define CH390_MAR 0x16     // Multicast Address Register (8 bytes)
#define CH390_BCASTCR 0x53 // Broadcast Control Register
#define CH390_GPCR 0x1E    // General Purpose Control Register
#define CH390_GPR 0x1F     // General Purpose Register
#define CH390_TCR2 0x2D    // TX Control Register 2
#define CH390_BPTR 0x08    // Backoff Preset Time Register
#define CH390_FCTR 0x09    // Flow Control Threshold Register
#define CH390_FCR 0x0A     // Flow Control Register
#define CH390_TCSCR 0x31   // TX Checksum Control Register
#define CH390_RCSCSR 0x32  // RX Checksum Control Status Register
#define CH390_MPTRCR 0x55  // MAC Pause Time Register
#define CH390_ISR 0x7E     // Interrupt Status Register
#define CH390_IMR 0x7F     // Interrupt Mask Register
#define CH390_INTCR 0x39   // Interrupt Control Register
#define CH390_INTCKCR 0x54 // Interrupt Clock Control Register
#define CH390_RLENCR 0x52  // RX Length Control Register
#define CH390_VIDL 0x28    // Vendor ID Low byte
#define CH390_VIDH 0x29    // Vendor ID High byte
#define CH390_PIDL 0x2A    // Product ID Low byte
#define CH390_PIDH 0x2B    // Product ID High byte
#define CH390_MRRH 0x75    // MAC RX Result High byte
#define CH390_MRRL 0x74    // MAC RX Result Low byte
#define CH390_TXPLL 0x7C   // TX Packet Length Low byte
#define CH390_TXPLH 0x7D   // TX Packet Length High byte
#define CH390_MWCMDX 0x76  // MAC Write Command Extended
#define CH390_MWCMD 0x78   // MAC Write Command
#define CH390_MRCMDX 0x70  // MAC Read Command Extended
#define CH390_MRCMD 0x72   // MAC Read Command

// NCR Register bits
#define NCR_RST (1 << 0)    // Software reset
#define NCR_LBK (3 << 1)    // Loopback mode
#define NCR_FDX (1 << 3)    // Full duplex
#define NCR_WAKEEN (1 << 6) // Wakeup enable

// NSR Register bits
#define NSR_RXOV (1 << 1)   // RX FIFO overflow
#define NSR_TX1END (1 << 2) // TX packet 1 complete
#define NSR_TX2END (1 << 3) // TX packet 2 complete
#define NSR_WAKEST (1 << 5) // Wakeup event
#define NSR_LINKST (1 << 6) // Link status
#define NSR_SPEED (1 << 7)  // Speed (0=10M, 1=100M)

// TCR Register bits
#define TCR_TXREQ (1 << 0) // TX request

// TCR2 Register bits
#define TCR2_RLCP (1 << 0) // Retry late collision packet

// TCSCR Register bits
#define TCSCR_IPCSE (1 << 0)  // IP checksum generation
#define TCSCR_TCPCSE (1 << 1) // TCP checksum generation
#define TCSCR_UDPCSE (1 << 2) // UDP checksum generation

// RLENCR Register bits
#define RLENCR_RXLEN_EN (1 << 7) // RX length limit enable
#define RLENCR_RXLEN_DEFAULT 24  // Default length (1536 bytes = 64*24)

// RCR Register bits
#define RCR_RXEN (1 << 0)     // RX enable
#define RCR_PRMSC (1 << 1)    // Promiscuous mode
#define RCR_RUNT (1 << 2)     // Accept runt packet
#define RCR_ALL (1 << 3)      // Accept all multicast
#define RCR_DIS_CRC (1 << 4)  // Discard CRC error packet
#define RCR_DIS_LONG (1 << 5) // Discard long packet

// RSR Register bits
#define RSR_AE (1 << 2)                // Alignment error
#define RSR_MF (1 << 6)                // Multicast frame
#define RSR_RF (1 << 7)                // Runt frame
#define RSR_ERR_MASK (RSR_AE | RSR_RF) // Error mask

