meshtastic/ESP32-CH390/src/esp_eth_mac_ch390_arduino.cpp
// EPCR Register bits
#define EPCR_ERRE (1 << 0)  // EEPROM/PHY access status (busy when 1)
#define EPCR_ERPRW (1 << 1) // EEPROM/PHY write access
#define EPCR_ERPRR (1 << 2) // EEPROM/PHY read access
#define EPCR_EPOS (1 << 3)  // EEPROM/PHY operation select
#define EPCR_WEP (1 << 4)   // Write enable protection

#define MPTRCR_RST_RX (1 << 0) // Reset RX FIFO pointer

#define ISR_PR (1 << 0)  // Packet received
#define ISR_PT (1 << 1)  // Packet transmitted
#define ISR_ROS (1 << 2) // RX over size
#define ISR_ROO (1 << 3) // RX overrun
#define ISR_CLR_STATUS                                                         \
  (ISR_PR | ISR_PT | ISR_ROS | ISR_ROO) // Clear status bits

#define IMR_PAR (1 << 7) // PHY auto-negotiation result
#define IMR_PRI (1 << 0) // Packet received interrupt

#define FCR_FLOW_ENABLE (0x39)
#define FCTR_HWOT(x) (((x)&0x0F) << 4)
#define FCTR_LWOT(x) ((x)&0x0F)

// PHY register base address
#define CH390_PHY 0x40 // Internal PHY base address

#define CH390_TX_FIFO_SIZE 3072
#define CH390_RX_FIFO_SIZE 16384

#define CH390_PKT_RDY 0x01
#define CH390_PKT_ERR 0xFE

#define CH390_SPI_LOCK_TIMEOUT_MS 50

typedef struct {
  uint8_t flag; // new ?
  uint8_t status;
  uint8_t length_low;
  uint8_t length_high;
  // uint8_t reserved;
} ch390_rx_header_t;

typedef struct {
  esp_eth_mac_t parent;
  esp_eth_mediator_t *eth;
  spi_device_handle_t spi_hdl;
  SemaphoreHandle_t spi_lock; // new ?
  TaskHandle_t rx_task_hdl;
  uint32_t sw_reset_timeout_ms;
  int int_gpio_num;
  uint8_t addr[6];
  bool packets_remain;
  bool flow_ctrl_enabled;
  uint8_t *rx_buffer; // new ?
} emac_ch390_t;

// Forward declarations
static esp_err_t ch390_write_reg(emac_ch390_t *emac, uint8_t reg,
                                 uint8_t value);
static esp_err_t ch390_read_reg(emac_ch390_t *emac, uint8_t reg,
                                uint8_t *value);

static esp_err_t emac_ch390_start(esp_eth_mac_t *mac);
static esp_err_t emac_ch390_stop(esp_eth_mac_t *mac);

static inline bool ch390_spi_lock(emac_ch390_t *emac) {
  return xSemaphoreTake(emac->spi_lock,
                        pdMS_TO_TICKS(CH390_SPI_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void ch390_spi_unlock(emac_ch390_t *emac) {
  xSemaphoreGive(emac->spi_lock);
}

static esp_err_t ch390_write_reg(emac_ch390_t *emac, uint8_t reg,
                                 uint8_t value) {
  esp_err_t ret = ESP_OK;
  spi_transaction_t trans = {.flags = SPI_TRANS_USE_TXDATA,
                             .cmd = CH390_SPI_WR,
                             .addr = (uint64_t)reg,
                             .length = 8,
                             .tx_data = {value}};
  if (!ch390_spi_lock(emac)) {
    return ESP_ERR_TIMEOUT;
  }
  ret = spi_device_polling_transmit(emac->spi_hdl, &trans);
  ch390_spi_unlock(emac);
  return ret;
}

static esp_err_t ch390_read_reg(emac_ch390_t *emac, uint8_t reg,
                                uint8_t *value) {
  esp_err_t ret = ESP_OK;
  spi_transaction_t trans = {
      .flags = SPI_TRANS_USE_RXDATA | SPI_TRANS_USE_TXDATA,
      .cmd = CH390_SPI_RD,
      .addr = (uint64_t)reg,
      .length = 8,
  };
  if (!ch390_spi_lock(emac)) {
    return ESP_ERR_TIMEOUT;
  }
  ret = spi_device_polling_transmit(emac->spi_hdl, &trans);
  ch390_spi_unlock(emac);
  *value = trans.rx_data[0];
  return ret;
}

static esp_err_t ch390_write_mem(emac_ch390_t *emac, uint8_t *buffer,
                                 uint32_t len) {
  esp_err_t ret = ESP_OK;
  spi_transaction_t trans;
  memset(&trans, 0, sizeof(trans));
  trans.cmd = CH390_SPI_WR;
  trans.addr = CH390_MWCMD;
  trans.length = len * 8;
  trans.tx_buffer = buffer;
  if (!ch390_spi_lock(emac)) {
    return ESP_ERR_TIMEOUT;
  }
  ret = spi_device_polling_transmit(emac->spi_hdl, &trans);
  ch390_spi_unlock(emac);
  return ret;
}

static esp_err_t ch390_read_mem(emac_ch390_t *emac, uint8_t *buffer,
                                uint32_t len) {
  esp_err_t ret = ESP_OK;
  spi_transaction_t trans;
  memset(&trans, 0, sizeof(trans));
  trans.cmd = CH390_SPI_RD;
  trans.addr = CH390_MRCMD;
  trans.length = len * 8;
  trans.rx_buffer = buffer;
  if (!ch390_spi_lock(emac)) {
    return ESP_ERR_TIMEOUT;
  }
  ret = spi_device_polling_transmit(emac->spi_hdl, &trans);
  ch390_spi_unlock(emac);
  return ret;
}

static esp_err_t ch390_set_mediator(esp_eth_mac_t *mac,
                                    esp_eth_mediator_t *eth) {
  if (!mac) {
    ESP_LOGE(TAG, "MAC can't be null");
    return ESP_ERR_INVALID_ARG;
  }
  if (!eth) {
    ESP_LOGE(TAG, "mediator can't be null");
    return ESP_ERR_INVALID_ARG;
  }
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  emac->eth = eth;
  return ESP_OK;
}

static esp_err_t ch390_write_phy_reg(esp_eth_mac_t *mac, uint32_t phy_addr,
                                     uint32_t phy_reg, uint32_t reg_value) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  uint8_t epcr_val;
  uint32_t timeout = 0;
  uint8_t epar_val;
  uint8_t epcr_cmd;

  epar_val = CH390_PHY | (phy_reg & 0x1F);
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_EPAR, epar_val), err, TAG,
                    "write EPAR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_EPDRL, reg_value & 0xFF), err,
                    TAG, "write EPDRL failed");
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_EPDRH, (reg_value >> 8) & 0xFF),
                    err, TAG, "write EPDRH failed");

  epcr_cmd = EPCR_EPOS | EPCR_ERPRW;
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_EPCR, epcr_cmd), err, TAG,
                    "write EPCR failed");

  timeout = 0;
  do {
    ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_EPCR, &epcr_val), err, TAG,
                      "read EPCR failed");
    if (!(epcr_val & EPCR_ERRE)) {
      break;
    }
    vTaskDelay(pdMS_TO_TICKS(1));
    timeout++;
  } while (timeout < 100);

  if (timeout >= 100) {
    ret = ESP_ERR_TIMEOUT;
    goto err;
  }

  return ESP_OK;

err:
  return ret;
}

static esp_err_t ch390_read_phy_reg(esp_eth_mac_t *mac, uint32_t phy_addr,
                                    uint32_t phy_reg, uint32_t *reg_value) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  uint8_t epcr_val;
  uint32_t timeout = 0;
  uint8_t epar_val;
  uint8_t epcr_cmd;
  uint8_t data_low, data_high;

  epar_val = CH390_PHY | (phy_reg & 0x1F);
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_EPAR, epar_val), err, TAG,
                    "write EPAR failed");

  epcr_cmd = EPCR_EPOS | EPCR_ERPRR;
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_EPCR, epcr_cmd), err, TAG,
                    "write EPCR failed");

  timeout = 0;
  do {
    ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_EPCR, &epcr_val), err, TAG,
                      "read EPCR failed");
    if (!(epcr_val & EPCR_ERRE)) {
      break;
    }
    vTaskDelay(pdMS_TO_TICKS(1));
    timeout++;
  } while (timeout < 100);

