meshtastic/ESP32-CH390/src/esp_eth_mac_ch390_arduino.cpp
  if (timeout >= 100) {
    ret = ESP_ERR_TIMEOUT;
    goto err;
  }

  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_EPDRL, &data_low), err, TAG,
                    "read EPDRL failed");
  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_EPDRH, &data_high), err, TAG,
                    "read EPDRH failed");

  *reg_value = (data_high << 8) | data_low;
  return ESP_OK;

err:
  *reg_value = 0;
  return ret;
}

static esp_err_t ch390_set_addr(esp_eth_mac_t *mac, uint8_t *addr) {
  esp_err_t ret = ESP_OK;
  if (!addr) {
    ESP_LOGE(TAG, "addr can't be null");
    return ESP_ERR_INVALID_ARG;
  }

  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  memcpy(emac->addr, addr, 6);

  // Write MAC address to CH390
  for (int i = 0; i < 6; i++) {
    ret = ch390_write_reg(emac, CH390_PAR + i, addr[i]);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "write PAR failed");
      return ret;
    }
  }
  return ESP_OK;
}

static esp_err_t ch390_get_addr(esp_eth_mac_t *mac, uint8_t *addr) {
  if (!addr) {
    ESP_LOGE(TAG, "addr can't be null");
    return ESP_ERR_INVALID_ARG;
  }
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  memcpy(addr, emac->addr, 6);
  return ESP_OK;
}

static esp_err_t ch390_set_link(esp_eth_mac_t *mac, eth_link_t link) {
  esp_err_t ret = ESP_OK;

  switch (link) {
  case ETH_LINK_UP:
    GOTO_ON_ERROR(emac_ch390_start(mac), err);
    break;
  case ETH_LINK_DOWN:
    GOTO_ON_ERROR(emac_ch390_stop(mac), err);
    break;
  default:
    ret = ESP_ERR_INVALID_ARG;
    return ret;
  }
  return ESP_OK;
err:
  return ret;
}

static esp_err_t ch390_set_speed(esp_eth_mac_t *mac, eth_speed_t speed) {
  switch (speed) {
  case ETH_SPEED_10M:
  case ETH_SPEED_100M:
    break;
  default:
    return ESP_ERR_INVALID_ARG;
  }
  return ESP_OK;
}

static esp_err_t ch390_set_duplex(esp_eth_mac_t *mac, eth_duplex_t duplex) {
  switch (duplex) {
  case ETH_DUPLEX_HALF:
  case ETH_DUPLEX_FULL:
    break;
  default:
    return ESP_ERR_INVALID_ARG;
  }
  return ESP_OK;
}

static esp_err_t ch390_set_promiscuous(esp_eth_mac_t *mac, bool enable) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  uint8_t rcr;
  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_RCR, &rcr), err, TAG,
                    "read RCR failed");
  if (enable) {
    rcr |= RCR_PRMSC;
  } else {
    rcr &= ~RCR_PRMSC;
  }
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_RCR, rcr), err, TAG,
                    "write RCR failed");
err:
  return ret;
}

static __attribute__((unused)) esp_err_t
ch390_enable_flow_ctrl(emac_ch390_t *emac, bool enable) {
  esp_err_t ret = ESP_OK;
  if (enable) {
    GOTO_ON_ERROR(ch390_write_reg(emac, CH390_BPTR, 0x3F), err);
    GOTO_ON_ERROR(
        ch390_write_reg(emac, CH390_FCTR, FCTR_HWOT(3) | FCTR_LWOT(8)), err);
    GOTO_ON_ERROR(ch390_write_reg(emac, CH390_FCR, FCR_FLOW_ENABLE), err);
  } else {
    GOTO_ON_ERROR(ch390_write_reg(emac, CH390_FCR, 0), err);
  }
err:
  return ret;
}

static esp_err_t ch390_drop_frame(emac_ch390_t *emac, uint16_t length) {
  esp_err_t ret = ESP_OK;
  uint8_t mrrh, mrrl;
  uint16_t addr = 0;

  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_MRRH, &mrrh), err);
  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_MRRL, &mrrl), err);

  addr = (mrrh << 8) | mrrl;
  addr += length;

  // Handle wraparound at 0x4000 boundary
  if (addr >= 0x4000) {
    addr -= 0x3400;
  }

  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_MRRH, addr >> 8), err);
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_MRRL, addr & 0xFF), err);
err:
  return ret;
}

static esp_err_t emac_ch390_start(esp_eth_mac_t *mac) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);

  // Reset RX memory pointer
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_MPTRCR, MPTRCR_RST_RX), err);

  // Clear interrupt status
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_ISR, ISR_CLR_STATUS), err);

  // Enable RX related interrupts
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_IMR, IMR_PAR | IMR_PRI), err);

  // Enable RX
  uint8_t rcr;
  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_RCR, &rcr), err);
  rcr |= RCR_RXEN;
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_RCR, rcr), err);

err:
  return ret;
}

static esp_err_t emac_ch390_stop(esp_eth_mac_t *mac) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);

  // Disable interrupts
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_IMR, 0x00), err);

  // Disable RX
  uint8_t rcr;
  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_RCR, &rcr), err);
  rcr &= ~RCR_RXEN;
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_RCR, rcr), err);

err:
  return ret;
}

static esp_err_t ch390_transmit(esp_eth_mac_t *mac, uint8_t *buf,
                                uint32_t length) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  uint8_t tcr;
  uint32_t wait = 0;

  if (length > 1522) {
    return ESP_ERR_INVALID_ARG;
  }

  // Copy data to TX memory first (chip has dual TX buffer)
  GOTO_ON_ERROR(ch390_write_mem(emac, buf, length), err);

  // Wait for previous transmit to complete (timeout ~1ms)
  do {
    GOTO_ON_ERROR(ch390_read_reg(emac, CH390_TCR, &tcr), err);
    if (!(tcr & TCR_TXREQ)) {
      break;
    }
    esp_rom_delay_us(10);
    wait += 10;
  } while (wait < 1000);

  if (tcr & TCR_TXREQ) {
    ESP_LOGE(TAG, "last transmit still in progress, cannot send.");
    return ESP_ERR_INVALID_STATE;
  }

  // Set TX length
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_TXPLL, length & 0xFF), err);
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_TXPLH, (length >> 8) & 0xFF), err);

  // Issue TX request (preserve existing TCR bits)
  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_TCR, &tcr), err);
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_TCR, tcr | TCR_TXREQ), err, TAG,
                    "write TCR failed");

err:
  return ret;
}

static esp_err_t ch390_receive(esp_eth_mac_t *mac, uint8_t *buf,
                               uint32_t *length) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  uint8_t ready;
  __attribute__((aligned(4))) ch390_rx_header_t header;
  uint16_t rx_len;

