meshtastic/ESP32-CH390/src/esp_eth_mac_ch390_arduino.cpp
  // Dummy read to get updated status, then read actual value
  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_MRCMDX, &ready), err);
  GOTO_ON_ERROR(ch390_read_reg(emac, CH390_MRCMDX, &ready), err);

  // Check for packet error - reset MAC if detected
  if (ready & CH390_PKT_ERR) {
    emac_ch390_stop(mac);
    vTaskDelay(pdMS_TO_TICKS(1));
    emac_ch390_start(mac);
    *length = 0;
    return ESP_ERR_INVALID_RESPONSE;
  }

  // Check if packet is ready
  if (!(ready & CH390_PKT_RDY)) {
    *length = 0;
    return ESP_OK;
  }

  // Read RX header
  GOTO_ON_ERROR(ch390_read_mem(emac, (uint8_t *)&header, sizeof(header)), err);

  rx_len = (header.length_high << 8) | header.length_low;

  // Check for frame errors
  if (header.status & RSR_ERR_MASK) {
    ch390_drop_frame(emac, rx_len);
    *length = 0;
    return ESP_ERR_INVALID_RESPONSE;
  }

  // Check frame size
  if (rx_len > *length || rx_len > 1522) {
    // Reset RX memory pointer on oversized frame
    ch390_write_reg(emac, CH390_MPTRCR, MPTRCR_RST_RX);

    *length = 0;
    return ESP_ERR_INVALID_SIZE;
  }

  // Read frame data
  GOTO_ON_ERROR(ch390_read_mem(emac, buf, rx_len), err);

  // Strip CRC
  *length = rx_len - ETH_CRC_LEN;
  return ESP_OK;

err:
  return ret;
}

static esp_err_t ch390_verify_id(emac_ch390_t *emac) {
  esp_err_t ret = ESP_OK;
  uint8_t vidl, vidh, pidl, pidh;

  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_VIDL, &vidl), err, TAG,
                    "read VIDL failed");
  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_VIDH, &vidh), err, TAG,
                    "read VIDH failed");

  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_PIDL, &pidl), err, TAG,
                    "read PIDL failed");
  ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_PIDH, &pidh), err, TAG,
                    "read PIDH failed");

  if (vidh != 0x1C || vidl != 0x00) {
    ret = ESP_ERR_INVALID_VERSION;
    goto err;
  }

  if (pidh != 0x91 || pidl != 0x51) {
    ret = ESP_ERR_INVALID_VERSION;
    goto err;
  }

  return ESP_OK;

err:
  return ret;
}

static esp_err_t ch390_clear_multicast_table(emac_ch390_t *emac) {
  esp_err_t ret = ESP_OK;

  // RX broadcast packet control
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_BCASTCR, 0x00), err);

  // Clear MAR 0-6
  for (int i = 0; i < 7; i++) {
    GOTO_ON_ERROR(ch390_write_reg(emac, CH390_MAR + i, 0x00), err);
  }

  // Enable broadcast reception (MAR7 bit 7)
  GOTO_ON_ERROR(ch390_write_reg(emac, CH390_MAR + 7, 0x80), err);

err:
  return ret;
}

static esp_err_t ch390_setup_default(emac_ch390_t *emac) {
  esp_err_t ret = ESP_OK;

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_NCR, 0x00), err, TAG,
                    "write NCR failed");
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_WCR, 0x00), err, TAG,
                    "write WCR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_TCR, 0x00), err, TAG,
                    "write TCR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_RCR, RCR_DIS_CRC | RCR_ALL),
                    err, TAG, "write RCR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_TCR2, TCR2_RLCP), err, TAG,
                    "write TCR2 failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_TCSCR,
                                    TCSCR_IPCSE | TCSCR_TCPCSE | TCSCR_UDPCSE),
                    err, TAG, "write TCSCR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_RCSCSR, 0x00), err, TAG,
                    "write RCSCSR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_INTCR, 0x00), err, TAG,
                    "write INTCR failed");
  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_INTCKCR, 0x00), err, TAG,
                    "write INTCKCR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_RLENCR,
                                    RLENCR_RXLEN_EN | RLENCR_RXLEN_DEFAULT),
                    err, TAG, "write RLENCR failed");

  ESP_GOTO_ON_ERROR(
      ch390_write_reg(emac, CH390_NSR, NSR_WAKEST | NSR_TX2END | NSR_TX1END),
      err, TAG, "write NSR failed");

  return ESP_OK;

err:
  return ret;
}

static esp_err_t ch390_init(esp_eth_mac_t *mac) {
  esp_err_t ret = ESP_OK;
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  esp_eth_mediator_t *eth = emac->eth;
  uint8_t ncr;
  uint32_t timeout = 0;

  if (eth) {
    ESP_GOTO_ON_ERROR(eth->on_state_changed(eth, ETH_STATE_LLINIT, NULL), err,
                      TAG, "lowlevel init failed");
  }

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_NCR, NCR_RST), err, TAG,
                    "write NCR failed");
  vTaskDelay(pdMS_TO_TICKS(10));

  do {
    ESP_GOTO_ON_ERROR(ch390_read_reg(emac, CH390_NCR, &ncr), err, TAG,
                      "read NCR failed");
    vTaskDelay(pdMS_TO_TICKS(10));
    timeout += 10;
  } while ((ncr & NCR_RST) && timeout < emac->sw_reset_timeout_ms);
  ESP_GOTO_ON_FALSE(!(ncr & NCR_RST), ESP_ERR_TIMEOUT, err, TAG,
                    "reset timeout");

  ESP_GOTO_ON_ERROR(ch390_verify_id(emac), err, TAG,
                    "chip ID verification failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_GPCR, 0x00), err, TAG,
                    "write GPCR failed");

  ESP_GOTO_ON_ERROR(ch390_write_reg(emac, CH390_GPR, 0x00), err, TAG,
                    "write GPR failed");
  vTaskDelay(pdMS_TO_TICKS(100));

  ESP_GOTO_ON_ERROR(ch390_setup_default(emac), err, TAG,
                    "ch390_setup_default failed");

  ESP_GOTO_ON_ERROR(ch390_set_addr(mac, emac->addr), err, TAG,
                    "set MAC address failed");

  GOTO_ON_ERROR(ch390_clear_multicast_table(emac), err);

  return ESP_OK;

err:
  if (eth) {
    eth->on_state_changed(eth, ETH_STATE_DEINIT, NULL);
  }
  return ret;
}

static esp_err_t ch390_deinit(esp_eth_mac_t *mac) {
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  esp_eth_mediator_t *eth = emac->eth;

  emac_ch390_stop(mac);

  if (eth) {
    eth->on_state_changed(eth, ETH_STATE_DEINIT, NULL);
  }
  return ESP_OK;
}

// enable_flow_ctrl and set_peer_pause_ability exist in IDF 4.4.7 (Arduino ABI).
// custom_ioctl is IDF 5.0+ only.
static esp_err_t ch390_mac_enable_flow_ctrl(esp_eth_mac_t *mac, bool enable) {
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  emac->flow_ctrl_enabled = enable;
  // CH390 doesn't have hardware flow control, so this is a no-op
  return ESP_OK;
}

