meshtastic/ESP32-CH390/src/esp_eth_mac_ch390_arduino.cpp
static esp_err_t ch390_set_peer_pause_ability(esp_eth_mac_t *mac,
                                              uint32_t ability) {
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);
  if (emac->flow_ctrl_enabled && ability) {
    ch390_enable_flow_ctrl(emac, true);
  } else {
    ch390_enable_flow_ctrl(emac, false);
  }
  return ESP_OK;
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
static esp_err_t ch390_custom_ioctl(esp_eth_mac_t *mac, uint32_t cmd,
                                    void *data) {
  // No custom ioctl commands supported
  return ESP_ERR_NOT_SUPPORTED;
}
#endif

static esp_err_t ch390_del(esp_eth_mac_t *mac) {
  emac_ch390_t *emac = __containerof(mac, emac_ch390_t, parent);

  if (emac->rx_task_hdl) {
    vTaskDelete(emac->rx_task_hdl);
  }

  if (emac->spi_lock) {
    vSemaphoreDelete(emac->spi_lock);
  }

  if (emac->spi_hdl) {
    spi_bus_remove_device(emac->spi_hdl);
  }

  if (emac->rx_buffer) {
    heap_caps_free(emac->rx_buffer);
  }

  free(emac);
  return ESP_OK;
}

static IRAM_ATTR void ch390_isr_handler(void *arg) {
  emac_ch390_t *emac = (emac_ch390_t *)arg;
  BaseType_t high_task_wakeup = pdFALSE;
  vTaskNotifyGiveFromISR(emac->rx_task_hdl, &high_task_wakeup);
  if (high_task_wakeup != pdFALSE) {
    portYIELD_FROM_ISR();
  }
}

static void emac_ch390_task(void *arg) {
  emac_ch390_t *emac = (emac_ch390_t *)arg;
  uint8_t status = 0;
  uint8_t *buffer;
  uint32_t rx_len;

  while (1) {
    if (emac->int_gpio_num >= 0) {
      if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(1000)) == 0 &&
          gpio_get_level((gpio_num_t)emac->int_gpio_num) == 0) {
        continue;
      }
    } else {
      vTaskDelay(pdMS_TO_TICKS(10));
    }

    // Clear interrupt status
    ch390_read_reg(emac, CH390_ISR, &status);
    ch390_write_reg(emac, CH390_ISR, status);

    // Process received packets
    if (status & ISR_PR) {
      do {
        rx_len = 1522;
        if (emac->parent.receive(&emac->parent, emac->rx_buffer, &rx_len) ==
            ESP_OK) {
          if (rx_len == 0) {
            break;
          }

          buffer = (uint8_t *)malloc(rx_len);
          if (buffer == NULL) {
            continue;
          }

          memcpy(buffer, emac->rx_buffer, rx_len);
          emac->eth->stack_input(emac->eth, buffer, rx_len);
        } else {
          break;
        }
      } while (1);
    }
  }
  vTaskDelete(NULL);
}

esp_eth_mac_t *
esp_eth_mac_new_ch390_arduino(const eth_ch390_config_t *ch390_config,
                              const eth_mac_config_t *mac_config) {
  emac_ch390_t *emac = NULL;

  if (!ch390_config || !mac_config) {
    ESP_LOGE(TAG, "invalid argument");
    return NULL;
  }

  emac = (emac_ch390_t *)calloc(1, sizeof(emac_ch390_t));
  if (!emac) {
    ESP_LOGE(TAG, "no mem for MAC instance");
    return NULL;
  }

  // Create SPI mutex
  emac->spi_lock = xSemaphoreCreateMutex();
  if (!emac->spi_lock) {
    free(emac);
    return NULL;
  }

  // Bind methods
  emac->parent.set_mediator = ch390_set_mediator;
  emac->parent.init = ch390_init;
  emac->parent.deinit = ch390_deinit;
  emac->parent.start = emac_ch390_start;
  emac->parent.stop = emac_ch390_stop;
  emac->parent.del = ch390_del;
  emac->parent.write_phy_reg = ch390_write_phy_reg;
  emac->parent.read_phy_reg = ch390_read_phy_reg;
  emac->parent.set_addr = ch390_set_addr;
  emac->parent.get_addr = ch390_get_addr;
  emac->parent.set_link = ch390_set_link;
  emac->parent.set_speed = ch390_set_speed;
  emac->parent.set_duplex = ch390_set_duplex;
  emac->parent.set_promiscuous = ch390_set_promiscuous;
  emac->parent.transmit = ch390_transmit;
  emac->parent.receive = ch390_receive;

  // enable_flow_ctrl and set_peer_pause_ability exist in IDF 4.4.7+ (Arduino
  // ABI) — must be assigned unconditionally, as the upstream W5500 driver does.
  emac->parent.enable_flow_ctrl = ch390_mac_enable_flow_ctrl;
  emac->parent.set_peer_pause_ability = ch390_set_peer_pause_ability;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  emac->parent.custom_ioctl = ch390_custom_ioctl;
#endif

  // Configure SPI device
  spi_device_interface_config_t spi_devcfg = *ch390_config->spi_devcfg;
  if (spi_devcfg.command_bits == 0 && spi_devcfg.address_bits == 0) {
    spi_devcfg.command_bits = 1;
    spi_devcfg.address_bits = 7;
  } else if (spi_devcfg.command_bits != 1 || spi_devcfg.address_bits != 7) {
    ESP_LOGE(TAG, "incorrect SPI frame format: command_bits must be 1, "
                  "address_bits must be 7");
    vSemaphoreDelete(emac->spi_lock);
    free(emac);
    return NULL;
  }

  esp_err_t spi_ret =
      spi_bus_add_device(ch390_config->spi_host, &spi_devcfg, &emac->spi_hdl);
  if (spi_ret != ESP_OK) {
    vSemaphoreDelete(emac->spi_lock);
    ESP_LOGE(TAG, "adding SPI device failed: %s (0x%x)",
             esp_err_to_name(spi_ret), spi_ret);
    free(emac);
    return NULL;
  }

  emac->int_gpio_num = ch390_config->int_gpio_num;
  emac->sw_reset_timeout_ms = mac_config->sw_reset_timeout_ms;
  emac->flow_ctrl_enabled = false; // Flow control disabled by default

  // Set MAC address: use custom if provided, otherwise get default from ESP32
  if (ch390_config->custom_mac_addr != NULL) {
    memcpy(emac->addr, ch390_config->custom_mac_addr, 6);
  } else {
    esp_read_mac(emac->addr, ESP_MAC_ETH);
  }
  // Allocate DMA-capable RX buffer
  emac->rx_buffer = (uint8_t *)heap_caps_malloc(1522, MALLOC_CAP_DMA);
  if (!emac->rx_buffer) {
    spi_bus_remove_device(emac->spi_hdl);
    vSemaphoreDelete(emac->spi_lock);
    free(emac);
    return NULL;
  }

  // Configure interrupt GPIO if specified
  if (emac->int_gpio_num >= 0) {
    gpio_set_direction((gpio_num_t)emac->int_gpio_num, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t)emac->int_gpio_num, GPIO_PULLDOWN_ONLY);
    gpio_set_intr_type((gpio_num_t)emac->int_gpio_num, GPIO_INTR_POSEDGE);
    gpio_intr_enable((gpio_num_t)emac->int_gpio_num);
    gpio_isr_handler_add((gpio_num_t)emac->int_gpio_num, ch390_isr_handler,
                         emac);
  }

  // Create RX task
  BaseType_t xReturned = xTaskCreatePinnedToCore(
      emac_ch390_task, "ch390_tsk", mac_config->rx_task_stack_size, emac,
      mac_config->rx_task_prio, &emac->rx_task_hdl, tskNO_AFFINITY);
  if (xReturned != pdPASS) {
    if (emac->int_gpio_num >= 0) {
      gpio_isr_handler_remove((gpio_num_t)emac->int_gpio_num);
    }
    heap_caps_free(emac->rx_buffer);
    spi_bus_remove_device(emac->spi_hdl);
    vSemaphoreDelete(emac->spi_lock);
    free(emac);
    return NULL;
  }

  return &emac->parent;
}
